def calculate_coins(sum):
    result = {}
    coins = [100, 50, 20, 10, 5, 2, 1]

    # Закръгляме числото така, че да работим с цели числа, тъй като сметките ще са много по-лесни
    sum = round(sum * 100)
    
    # След това, почваме алчно с най-голямата монета
    # Гледаме колко може да платим с тази монета, като делим целочислено
    # Ако имаме 894 лева, то 894 // 100 ще ни даде 8 пъти да платим
    # След това намаляваме суата 894 - 8 * 100 и оставаме с 94 лева.
    # След това, 94 // 50 = 1 - 1 път плащаме и правим 94 - 50 = 44
    # След това 44 // 20 = 2 - 2 пъти плащаме и правим 44 - 2 * 20 = 4
    # След това 4 // 5 = 0 - не можем
    # След това 4 // 2 = 2, и оставаме с 0 лева, с които не може да платим нищо друго
    for coin in coins:
        times_to_pay = sum // coin

        result[coin] = times_to_pay

        sum -= times_to_pay * coin

    return result

print(calculate_coins(8.94) == { 1: 0, 2: 2, 100: 8, 5: 0, 10: 0, 50: 1, 20: 2 })
print(calculate_coins(0.53) == { 1: 1, 2: 1, 100: 0, 5: 0, 10: 0, 50: 1, 20: 0 })
