# Решението на тази задача е "алчно"
# За всяка линия, взимаме най-евтиното решение спрямо броя на пътуванията
def travel(travels):
    total_sum = 0

    for travel in travels:
        # Ако сме пътували над 23 пъти, взимаме карта
        # Иначе си взимаме толкова на брой билетчета, колкото са пътуванията
        if travel >= 23:
            total_sum += 23
        else:
            total_sum += travel * 1

        # Ако случайно платим над 50 лева, си взимаме карта за цяла градска мрежа
        if total_sum >= 50:
            return 50

    return total_sum

print(travel([23, 24, 2]) == 48)
print(travel([28, 5, 23]) == 50)
print(travel([1, 1, 1, 1, 1, 1, 1, 1, 1]) == 9)
print(travel([1] * 51) == 50)
